### **Clase 1 - Control de Flujo con Pandas**

#### **`Importar Librerias`**

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy as sp
import seaborn as sns
import plotly

#### **`Importar un archivo CSV en un Dataframe`**

In [2]:
dt = pd.read_csv('flights.csv')

dt

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [34]:
df = pd.read_csv('datos_persona.csv')

df

   indice sexo  altura  peso     nombre
0       0    F    1.64    68    Javiera
1       1    M    1.53    43       Jose
2       2    M    1.87    90      Tomas
3       3    F    1.67    95      Maria
4       4    M    2.01   100       Jose
5       5    F    1.45    50  Magdalena
6       6    F    1.67    67   Trinidad
7       7    M    1.93   102    Gonzalo
8       8    M    1.72    76      David
9       9    M    1.64    68     Javier

In [3]:
de = pd.read_csv('letras.csv')

de

  letra  valor  condicion
0     a      2       True
1     b      4      False
2     a      6       True
3     c      2       True
4     e      1      False

#### **`Seleccionar una columna de un Dataframe`**

In [5]:
dt['passengers']

0      112
1      118
2      132
3      129
4      121
      ...
139    606
140    508
141    461
142    390
143    432
Name: passengers, Length: 144, dtype: int64

Esto corresponde a una **`Serie`**

In [6]:
type(dt['passengers'])

pandas.core.series.Series

#### **`Recorrer una Serie`**

In [7]:
for i in dt['passengers']:
    print(i, type(i))

112 <class 'int'>
118 <class 'int'>
132 <class 'int'>
129 <class 'int'>
121 <class 'int'>
135 <class 'int'>
148 <class 'int'>
148 <class 'int'>
136 <class 'int'>
119 <class 'int'>
104 <class 'int'>
118 <class 'int'>
115 <class 'int'>
126 <class 'int'>
141 <class 'int'>
135 <class 'int'>
125 <class 'int'>
149 <class 'int'>
170 <class 'int'>
170 <class 'int'>
158 <class 'int'>
133 <class 'int'>
114 <class 'int'>
140 <class 'int'>
145 <class 'int'>
150 <class 'int'>
178 <class 'int'>
163 <class 'int'>
172 <class 'int'>
178 <class 'int'>
199 <class 'int'>
199 <class 'int'>
184 <class 'int'>
162 <class 'int'>
146 <class 'int'>
166 <class 'int'>
171 <class 'int'>
180 <class 'int'>
193 <class 'int'>
181 <class 'int'>
183 <class 'int'>
218 <class 'int'>
230 <class 'int'>
242 <class 'int'>
209 <class 'int'>
191 <class 'int'>
172 <class 'int'>
194 <class 'int'>
196 <class 'int'>
196 <class 'int'>
236 <class 'int'>
235 <class 'int'>
229 <class 'int'>
243 <class 'int'>
264 <class 'int'>
272 <class 'int'>
237 <class 'int'>
211 <class 'int'>
180 <class 'int'>
201 <class 'int'>
204 <class 'int'>
188 <class 'int'>
235 <class 'int'>
227 <class 'int'>
234 <class 'int'>
264 <class 'int'>
302 <class 'int'>
293 <class 'int'>
259 <class 'int'>
229 <class 'int'>
203 <class 'int'>
229 <class 'int'>
242 <class 'int'>
233 <class 'int'>
267 <class 'int'>
269 <class 'int'>
270 <class 'int'>
315 <class 'int'>
364 <class 'int'>
347 <class 'int'>
312 <class 'int'>
274 <class 'int'>
237 <class 'int'>
278 <class 'int'>
284 <class 'int'>
277 <class 'int'>
317 <class 'int'>
313 <class 'int'>
318 <class 'int'>
374 <class 'int'>
413 <class 'int'>
405 <class 'int'>
355 <class 'int'>
306 <class 'int'>
271 <class 'int'>
306 <class 'int'>
315 <class 'int'>
301 <class 'int'>
356 <class 'int'>
348 <class 'int'>
355 <class 'int'>
422 <class 'int'>
465 <class 'int'>
467 <class 'int'>
404 <class 'int'>
347 <class 'int'>
305 <class 'int'>
336 <class 'int'>
340 <class 'int'>
318 <class 'int'>
362 <class 'int'>
348 <class 'int'>
363 <class 'int'>
435 <class 'int'>
491 <class 'int'>
505 <class 'int'>
404 <class 'int'>
359 <class 'int'>
310 <class 'int'>
337 <class 'int'>
360 <class 'int'>
342 <class 'int'>
406 <class 'int'>
396 <class 'int'>
420 <class 'int'>
472 <class 'int'>
548 <class 'int'>
559 <class 'int'>
463 <class 'int'>
407 <class 'int'>
362 <class 'int'>
405 <class 'int'>
417 <class 'int'>
391 <class 'int'>
419 <class 'int'>
461 <class 'int'>
472 <class 'int'>
535 <class 'int'>
622 <class 'int'>
606 <class 'int'>
508 <class 'int'>
461 <class 'int'>
390 <class 'int'>
432 <class 'int'>

##### **`index`**

Podemos aplicar funciones a nivel de **`Serie`**

In [10]:
for i in dt['passengers'].index:
    print(i)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
110
111
112
113
114
115
116
117
118
119
120
121
122
123
124
125
126
127
128
129
130
131
132
133
134
135
136
137
138
139
140
141
142
143

In [11]:
for i in dt['passengers'] * 2:
    print(i)

224
236
264
258
242
270
296
296
272
238
208
236
230
252
282
270
250
298
340
340
316
266
228
280
290
300
356
326
344
356
398
398
368
324
292
332
342
360
386
362
366
436
460
484
418
382
344
388
392
392
472
470
458
486
528
544
474
422
360
402
408
376
470
454
468
528
604
586
518
458
406
458
484
466
534
538
540
630
728
694
624
548
474
556
568
554
634
626
636
748
826
810
710
612
542
612
630
602
712
696
710
844
930
934
808
694
610
672
680
636
724
696
726
870
982
1010
808
718
620
674
720
684
812
792
840
944
1096
1118
926
814
724
810
834
782
838
922
944
1070
1244
1212
1016
922
780
864

#### **`Recorrer un Dataframe`**

##### **`iteritems()`**

- La dirección de recorrido es hacia la **`DERECHA`**
- Recorro columna por columna el Dataframe
- Me permite recorrer los nombres de las columnas

In [12]:
for colname, serie in dt.iteritems():
    print(colname)

year
month
passengers

- Me permite recorrer los datos de cada columna, columna por columna
- Primero la columna de AÑO, luego la columna de MES y finalmente la columna de PASAJEROS

In [15]:
for colname, serie in dt.iteritems():
    print(serie)

0      1949
1      1949
2      1949
3      1949
4      1949
       ...
139    1960
140    1960
141    1960
142    1960
143    1960
Name: year, Length: 144, dtype: int64
0        January
1       February
2          March
3          April
4            May
         ...
139       August
140    September
141      October
142     November
143     December
Name: month, Length: 144, dtype: object
0      112
1      118
2      132
3      129
4      121
      ...
139    606
140    508
141    461
142    390
143    432
Name: passengers, Length: 144, dtype: int64

Podemos también ver los tipos de datos de cada una de estas columnas

In [16]:
for colname, serie in dt.iteritems():
    print(serie.dtype)

int64
object
int64

##### **`iterrows()`**

- La dirección de recorrido es hacia la **`ABAJO`**
- Recorro fila por fila el Dataframe
- Me permite recorrer los indices de las filas

In [23]:
for idx, row in dt.iterrows():
    print(idx)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
110
111
112
113
114
115
116
117
118
119
120
121
122
123
124
125
126
127
128
129
130
131
132
133
134
135
136
137
138
139
140
141
142
143

Podemos recorrer fila por fila

In [24]:
for idx, row in dt.iterrows():
    print(row)
    print()

year             1949
month         January
passengers        112
Name: 0, dtype: object

year              1949
month         February
passengers         118
Name: 1, dtype: object

year           1949
month         March
passengers      132
Name: 2, dtype: object

year           1949
month         April
passengers      129
Name: 3, dtype: object

year          1949
month          May
passengers     121
Name: 4, dtype: object

year          1949
month         June
passengers     135
Name: 5, dtype: object

year          1949
month         July
passengers     148
Name: 6, dtype: object

year            1949
month         August
passengers       148
Name: 7, dtype: object

year               1949
month         September
passengers          136
Name: 8, dtype: object

year             1949
month         October
passengers        119
Name: 9, dtype: object

year              1949
month         November
passengers         104
Name: 10, dtype: object

year              1949
month         December
passengers         118
Name: 11, dtype: object

year             1950
month         January
passengers        115
Name: 12, dtype: object

year              1950
month         February
passengers         126
Name: 13, dtype: object

year           1950
month         March
passengers      141
Name: 14, dtype: object

year           1950
month         April
passengers      135
Name: 15, dtype: object

year          1950
month          May
passengers     125
Name: 16, dtype: object

year          1950
month         June
passengers     149
Name: 17, dtype: object

year          1950
month         July
passengers     170
Name: 18, dtype: object

year            1950
month         August
passengers       170
Name: 19, dtype: object

year               1950
month         September
passengers          158
Name: 20, dtype: object

year             1950
month         October
passengers        133
Name: 21, dtype: object

year              1950
month         November
passengers         114
Name: 22, dtype: object

year              1950
month         December
passengers         140
Name: 23, dtype: object

year             1951
month         January
passengers        145
Name: 24, dtype: object

year              1951
month         February
passengers         150
Name: 25, dtype: object

year           1951
month         March
passengers      178
Name: 26, dtype: object

year           1951
month         April
passengers      163
Name: 27, dtype: object

year          1951
month          May
passengers     172
Name: 28, dtype: object

year          1951
month         June
passengers     178
Name: 29, dtype: object

year          1951
month         July
passengers     199
Name: 30, dtype: object

year            1951
month         August
passengers       199
Name: 31, dtype: object

year               1951
month         September
passengers          184
Name: 32, dtype: object

year             1951
month         October
passengers        162
Name: 33, dtype: object

year              1951
month         November
passengers         146
Name: 34, dtype: object

year              1951
month         December
passengers         166
Name: 35, dtype: object

year             1952
month         January
passengers        171
Name: 36, dtype: object

year              1952
month         February
passengers         180
Name: 37, dtype: object

year           1952
month         March
passengers      193
Name: 38, dtype: object

year           1952
month         April
passengers      181
Name: 39, dtype: object

year          1952
month          May
passengers     183
Name: 40, dtype: object

year          1952
month         June
passengers     218
Name: 41, dtype: object

year          1952
month         July
passengers     230
Name: 42, dtype: object

year            1952
month         August
passengers       242
Name: 43, dtype: object

year               1952
month         September
passengers          209
Name: 44, dtype: object

year             1952
month         October
passengers        191
Name: 45, dtype: object

year              1952
month         November
passengers         172
Name: 46, dtype: object

year              1952
month         December
passengers         194
Name: 47, dtype: object

year             1953
month         January
passengers        196
Name: 48, dtype: object

year              1953
month         February
passengers         196
Name: 49, dtype: object

year           1953
month         March
passengers      236
Name: 50, dtype: object

year           1953
month         April
passengers      235
Name: 51, dtype: object

year          1953
month          May
passengers     229
Name: 52, dtype: object

year          1953
month         June
passengers     243
Name: 53, dtype: object

year          1953
month         July
passengers     264
Name: 54, dtype: object

year            1953
month         August
passengers       272
Name: 55, dtype: object

year               1953
month         September
passengers          237
Name: 56, dtype: object

year             1953
month         October
passengers        211
Name: 57, dtype: object

year              1953
month         November
passengers         180
Name: 58, dtype: object

year              1953
month         December
passengers         201
Name: 59, dtype: object

year             1954
month         January
passengers        204
Name: 60, dtype: object

year              1954
month         February
passengers         188
Name: 61, dtype: object

year           1954
month         March
passengers      235
Name: 62, dtype: object

year           1954
month         April
passengers      227
Name: 63, dtype: object

year          1954
month          May
passengers     234
Name: 64, dtype: object

year          1954
month         June
passengers     264
Name: 65, dtype: object

year          1954
month         July
passengers     302
Name: 66, dtype: object

year            1954
month         August
passengers       293
Name: 67, dtype: object

year               1954
month         September
passengers          259
Name: 68, dtype: object

year             1954
month         October
passengers        229
Name: 69, dtype: object

year              1954
month         November
passengers         203
Name: 70, dtype: object

year              1954
month         December
passengers         229
Name: 71, dtype: object

year             1955
month         January
passengers        242
Name: 72, dtype: object

year              1955
month         February
passengers         233
Name: 73, dtype: object

year           1955
month         March
passengers      267
Name: 74, dtype: object

year           1955
month         April
passengers      269
Name: 75, dtype: object

year          1955
month          May
passengers     270
Name: 76, dtype: object

year          1955
month         June
passengers     315
Name: 77, dtype: object

year          1955
month         July
passengers     364
Name: 78, dtype: object

year            1955
month         August
passengers       347
Name: 79, dtype: object

year               1955
month         September
passengers          312
Name: 80, dtype: object

year             1955
month         October
passengers        274
Name: 81, dtype: object

year              1955
month         November
passengers         237
Name: 82, dtype: object

year              1955
month         December
passengers         278
Name: 83, dtype: object

year             1956
month         January
passengers        284
Name: 84, dtype: object

year              1956
month         February
passengers         277
Name: 85, dtype: object

year           1956
month         March
passengers      317
Name: 86, dtype: object

year           1956
month         April
passengers      313
Name: 87, dtype: object

year          1956
month          May
passengers     318
Name: 88, dtype: object

year          1956
month         June
passengers     374
Name: 89, dtype: object

year          1956
month         July
passengers     413
Name: 90, dtype: object

year            1956
month         August
passengers       405
Name: 91, dtype: object

year               1956
month         September
passengers          355
Name: 92, dtype: object

year             1956
month         October
passengers        306
Name: 93, dtype: object

year              1956
month         November
passengers         271
Name: 94, dtype: object

year              1956
month         December
passengers         306
Name: 95, dtype: object

year             1957
month         January
passengers        315
Name: 96, dtype: object

year              1957
month         February
passengers         301
Name: 97, dtype: object

year           1957
month         March
passengers      356
Name: 98, dtype: object

year           1957
month         April
passengers      348
Name: 99, dtype: object

year          1957
month          May
passengers     355
Name: 100, dtype: object

year          1957
month         June
passengers     422
Name: 101, dtype: object

year          1957
month         July
passengers     465
Name: 102, dtype: object

year            1957
month         August
passengers       467
Name: 103, dtype: object

year               1957
month         September
passengers          404
Name: 104, dtype: object

year             1957
month         October
passengers        347
Name: 105, dtype: object

year              1957
month         November
passengers         305
Name: 106, dtype: object

year              1957
month         December
passengers         336
Name: 107, dtype: object

year             1958
month         January
passengers        340
Name: 108, dtype: object

year              1958
month         February
passengers         318
Name: 109, dtype: object

year           1958
month         March
passengers      362
Name: 110, dtype: object

year           1958
month         April
passengers      348
Name: 111, dtype: object

year          1958
month          May
passengers     363
Name: 112, dtype: object

year          1958
month         June
passengers     435
Name: 113, dtype: object

year          1958
month         July
passengers     491
Name: 114, dtype: object

year            1958
month         August
passengers       505
Name: 115, dtype: object

year               1958
month         September
passengers          404
Name: 116, dtype: object

year             1958
month         October
passengers        359
Name: 117, dtype: object

year              1958
month         November
passengers         310
Name: 118, dtype: object

year              1958
month         December
passengers         337
Name: 119, dtype: object

year             1959
month         January
passengers        360
Name: 120, dtype: object

year              1959
month         February
passengers         342
Name: 121, dtype: object

year           1959
month         March
passengers      406
Name: 122, dtype: object

year           1959
month         April
passengers      396
Name: 123, dtype: object

year          1959
month          May
passengers     420
Name: 124, dtype: object

year          1959
month         June
passengers     472
Name: 125, dtype: object

year          1959
month         July
passengers     548
Name: 126, dtype: object

year            1959
month         August
passengers       559
Name: 127, dtype: object

year               1959
month         September
passengers          463
Name: 128, dtype: object

year             1959
month         October
passengers        407
Name: 129, dtype: object

year              1959
month         November
passengers         362
Name: 130, dtype: object

year              1959
month         December
passengers         405
Name: 131, dtype: object

year             1960
month         January
passengers        417
Name: 132, dtype: object

year              1960
month         February
passengers         391
Name: 133, dtype: object

year           1960
month         March
passengers      419
Name: 134, dtype: object

year           1960
month         April
passengers      461
Name: 135, dtype: object

year          1960
month          May
passengers     472
Name: 136, dtype: object

year          1960
month         June
passengers     535
Name: 137, dtype: object

year          1960
month         July
passengers     622
Name: 138, dtype: object

year            1960
month         August
passengers       606
Name: 139, dtype: object

year               1960
month         September
passengers          508
Name: 140, dtype: object

year             1960
month         October
passengers        461
Name: 141, dtype: object

year              1960
month         November
passengers         390
Name: 142, dtype: object

year              1960
month         December
passengers         432
Name: 143, dtype: object

In [35]:
for idx, row in df.iterrows():
    print(row['nombre'])
    print()

Javiera

Jose

Tomas

Maria

Jose

Magdalena

Trinidad

Gonzalo

David

Javier

#### **`A nivel de Dataframe determinar un subconjunto (subset booleano)`**

##### **`Ejemplo 1`**

Es to es una serie:

In [26]:
dt['month'] == 'January'

0       True
1      False
2      False
3      False
4      False
       ...
139    False
140    False
141    False
142    False
143    False
Name: month, Length: 144, dtype: bool

In [70]:
serie = dt['month'] == 'January'

print(type(serie))

<class 'pandas.core.series.Series'>

Se aplica a nivel del Dataframe. Esto es un Dataframe:

In [25]:
dt[dt['month'] == 'January']

     year    month  passengers
0    1949  January         112
12   1950  January         115
24   1951  January         145
36   1952  January         171
48   1953  January         196
60   1954  January         204
72   1955  January         242
84   1956  January         284
96   1957  January         315
108  1958  January         340
120  1959  January         360
132  1960  January         417

In [68]:
dataframe = dt[dt['month'] == 'January']

print(type(dataframe))

<class 'pandas.core.frame.DataFrame'>

##### **`Ejemplo 2`**

In [8]:
de.index < 3

array([ True,  True,  True, False, False])

In [11]:
de[de.index < 3]

  letra  valor  condicion
0     a      2       True
1     b      4      False
2     a      6       True

También podemos obtener el mismo resultado utilizando SLICE

In [9]:
de[:3]

  letra  valor  condicion
0     a      2       True
1     b      4      False
2     a      6       True

#### **`A nivel de Dataframe: iterrows condicionales`**

##### **`Ejemplo 1`**

Iterar siempre es una forma ineficiente, imaginandonos que fueran a existir miles y miles de registros

In [36]:
mean_male = 0
for index, row in df.iterrows():
    if row['sexo'] == 'M':
        mean_male += row['peso']

print(mean_male/6)

79.83333333333333

Por tanto, podemos hacer lo siguiente:

In [45]:
df[df['sexo'] == 'M']['peso'].mean()

79.83333333333333

In [44]:
for index, row in df.iterrows():
    if row['sexo'] == 'M':
        print(row['peso'])

43
90
100
102
76
68

##### **`Ejemplo 2`**

Calcular el **`PROMEDIO DEL PESO`** según el **`SEXO`**

In [66]:
s = df['sexo'].unique()

s

array(['F', 'M'], dtype=object)

In [67]:
for sexo in df['sexo'].unique():
    print(sexo)

F
M

In [65]:
for sexo in df['sexo'].unique():
    print(f"{sexo}: {df[df['sexo']==sexo]['peso'].mean()}")

F: 70.0
M: 79.83333333333333

In [71]:
df.groupby('sexo').agg({'peso':'mean'})

           peso
sexo
F     70.000000
M     79.833333

Calcular el **`PROMEDIO DE PASAJEROS`** según el **`AÑO`** y el **`MES`**

In [74]:
dt.groupby(['year','month']).agg({'passengers':'mean'})

                passengers
year month
1949 April           129.0
     August          148.0
     December        118.0
     February        118.0
     January         112.0
...                    ...
1960 March           419.0
     May             472.0
     November        390.0
     October         461.0
     September       508.0

[144 rows x 1 columns]